Detectron v2 is not installed
Setting up [LPIPS] perceptual loss: trunk [alex], v[0.1], spatial [off]
Loading model from: /home/Drive3/Dharshan/Venv/inpenv/lib/python3.6/site-packages/lpips/weights/v0.1/alex.pth
cuda:0
cuda:0
/home/Drive3/Dharshan/Venv/lama/ImageNet/train
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           2,944
            Conv2d-2        [-1, 128, 112, 112]          73,856
            Conv2d-3         [-1, 32, 112, 112]           4,128
            Conv2d-4          [-1, 256, 56, 56]          33,024
              GELU-5          [-1, 256, 56, 56]               0
           Dropout-6          [-1, 256, 56, 56]               0
            Conv2d-7          [-1, 128, 56, 56]          32,896
       BatchNorm2d-8          [-1, 128, 56, 56]             256
   ConvTranspose2d-9        [-1, 128, 112, 112]         262,272
           Conv2d-10        [-1, 128, 112, 112]           3,328
             GELU-11        [-1, 128, 112, 112]               0
      BatchNorm2d-12        [-1, 128, 112, 112]             256
        Waveblock-13        [-1, 128, 112, 112]               0
           Conv2d-14         [-1, 32, 112, 112]           4,128
           Conv2d-15          [-1, 256, 56, 56]          33,024
             GELU-16          [-1, 256, 56, 56]               0
          Dropout-17          [-1, 256, 56, 56]               0
           Conv2d-18          [-1, 128, 56, 56]          32,896
      BatchNorm2d-19          [-1, 128, 56, 56]             256
  ConvTranspose2d-20        [-1, 128, 112, 112]         262,272
           Conv2d-21        [-1, 128, 112, 112]           3,328
             GELU-22        [-1, 128, 112, 112]               0
      BatchNorm2d-23        [-1, 128, 112, 112]             256
        Waveblock-24        [-1, 128, 112, 112]               0
           Conv2d-25         [-1, 32, 112, 112]           4,128
           Conv2d-26          [-1, 256, 56, 56]          33,024
             GELU-27          [-1, 256, 56, 56]               0
          Dropout-28          [-1, 256, 56, 56]               0
           Conv2d-29          [-1, 128, 56, 56]          32,896
      BatchNorm2d-30          [-1, 128, 56, 56]             256
  ConvTranspose2d-31        [-1, 128, 112, 112]         262,272
           Conv2d-32        [-1, 128, 112, 112]           3,328
             GELU-33        [-1, 128, 112, 112]               0
      BatchNorm2d-34        [-1, 128, 112, 112]             256
        Waveblock-35        [-1, 128, 112, 112]               0
           Conv2d-36         [-1, 32, 112, 112]           4,128
           Conv2d-37          [-1, 256, 56, 56]          33,024
             GELU-38          [-1, 256, 56, 56]               0
          Dropout-39          [-1, 256, 56, 56]               0
           Conv2d-40          [-1, 128, 56, 56]          32,896
      BatchNorm2d-41          [-1, 128, 56, 56]             256
  ConvTranspose2d-42        [-1, 128, 112, 112]         262,272
           Conv2d-43        [-1, 128, 112, 112]           3,328
             GELU-44        [-1, 128, 112, 112]               0
      BatchNorm2d-45        [-1, 128, 112, 112]             256
        Waveblock-46        [-1, 128, 112, 112]               0
           Conv2d-47         [-1, 32, 112, 112]           4,128
           Conv2d-48          [-1, 256, 56, 56]          33,024
             GELU-49          [-1, 256, 56, 56]               0
          Dropout-50          [-1, 256, 56, 56]               0
           Conv2d-51          [-1, 128, 56, 56]          32,896
      BatchNorm2d-52          [-1, 128, 56, 56]             256
  ConvTranspose2d-53        [-1, 128, 112, 112]         262,272
           Conv2d-54        [-1, 128, 112, 112]           3,328
             GELU-55        [-1, 128, 112, 112]               0
      BatchNorm2d-56        [-1, 128, 112, 112]             256
        Waveblock-57        [-1, 128, 112, 112]               0
           Conv2d-58         [-1, 32, 112, 112]           4,128
           Conv2d-59          [-1, 256, 56, 56]          33,024
             GELU-60          [-1, 256, 56, 56]               0
          Dropout-61          [-1, 256, 56, 56]               0
           Conv2d-62          [-1, 128, 56, 56]          32,896
      BatchNorm2d-63          [-1, 128, 56, 56]             256
  ConvTranspose2d-64        [-1, 128, 112, 112]         262,272
           Conv2d-65        [-1, 128, 112, 112]           3,328
             GELU-66        [-1, 128, 112, 112]               0
      BatchNorm2d-67        [-1, 128, 112, 112]             256
        Waveblock-68        [-1, 128, 112, 112]               0
           Conv2d-69         [-1, 32, 112, 112]           4,128
           Conv2d-70          [-1, 256, 56, 56]          33,024
             GELU-71          [-1, 256, 56, 56]               0
          Dropout-72          [-1, 256, 56, 56]               0
           Conv2d-73          [-1, 128, 56, 56]          32,896
      BatchNorm2d-74          [-1, 128, 56, 56]             256
  ConvTranspose2d-75        [-1, 128, 112, 112]         262,272
           Conv2d-76        [-1, 128, 112, 112]           3,328
             GELU-77        [-1, 128, 112, 112]               0
      BatchNorm2d-78        [-1, 128, 112, 112]             256
        Waveblock-79        [-1, 128, 112, 112]               0
  ConvTranspose2d-80         [-1, 64, 224, 224]         262,208
  ConvTranspose2d-81         [-1, 64, 224, 224]          36,928
      BatchNorm2d-82         [-1, 64, 224, 224]             128
  ConvTranspose2d-83          [-1, 3, 224, 224]           5,028
          WaveMix-84          [-1, 3, 224, 224]               0
           Conv2d-85         [-1, 64, 224, 224]           2,944
           Conv2d-86        [-1, 128, 112, 112]          73,856
           Conv2d-87         [-1, 32, 112, 112]           4,128
           Conv2d-88          [-1, 256, 56, 56]          33,024
             GELU-89          [-1, 256, 56, 56]               0
          Dropout-90          [-1, 256, 56, 56]               0
           Conv2d-91          [-1, 128, 56, 56]          32,896
      BatchNorm2d-92          [-1, 128, 56, 56]             256
  ConvTranspose2d-93        [-1, 128, 112, 112]         262,272
           Conv2d-94        [-1, 128, 112, 112]           3,328
             GELU-95        [-1, 128, 112, 112]               0
      BatchNorm2d-96        [-1, 128, 112, 112]             256
        Waveblock-97        [-1, 128, 112, 112]               0
           Conv2d-98         [-1, 32, 112, 112]           4,128
           Conv2d-99          [-1, 256, 56, 56]          33,024
            GELU-100          [-1, 256, 56, 56]               0
         Dropout-101          [-1, 256, 56, 56]               0
          Conv2d-102          [-1, 128, 56, 56]          32,896
     BatchNorm2d-103          [-1, 128, 56, 56]             256
 ConvTranspose2d-104        [-1, 128, 112, 112]         262,272
          Conv2d-105        [-1, 128, 112, 112]           3,328
            GELU-106        [-1, 128, 112, 112]               0
     BatchNorm2d-107        [-1, 128, 112, 112]             256
       Waveblock-108        [-1, 128, 112, 112]               0
          Conv2d-109         [-1, 32, 112, 112]           4,128
          Conv2d-110          [-1, 256, 56, 56]          33,024
            GELU-111          [-1, 256, 56, 56]               0
         Dropout-112          [-1, 256, 56, 56]               0
          Conv2d-113          [-1, 128, 56, 56]          32,896
     BatchNorm2d-114          [-1, 128, 56, 56]             256
 ConvTranspose2d-115        [-1, 128, 112, 112]         262,272
          Conv2d-116        [-1, 128, 112, 112]           3,328
            GELU-117        [-1, 128, 112, 112]               0
     BatchNorm2d-118        [-1, 128, 112, 112]             256
       Waveblock-119        [-1, 128, 112, 112]               0
          Conv2d-120         [-1, 32, 112, 112]           4,128
          Conv2d-121          [-1, 256, 56, 56]          33,024
            GELU-122          [-1, 256, 56, 56]               0
         Dropout-123          [-1, 256, 56, 56]               0
          Conv2d-124          [-1, 128, 56, 56]          32,896
     BatchNorm2d-125          [-1, 128, 56, 56]             256
 ConvTranspose2d-126        [-1, 128, 112, 112]         262,272
          Conv2d-127        [-1, 128, 112, 112]           3,328
            GELU-128        [-1, 128, 112, 112]               0
     BatchNorm2d-129        [-1, 128, 112, 112]             256
       Waveblock-130        [-1, 128, 112, 112]               0
          Conv2d-131         [-1, 32, 112, 112]           4,128
          Conv2d-132          [-1, 256, 56, 56]          33,024
            GELU-133          [-1, 256, 56, 56]               0
         Dropout-134          [-1, 256, 56, 56]               0
          Conv2d-135          [-1, 128, 56, 56]          32,896
     BatchNorm2d-136          [-1, 128, 56, 56]             256
 ConvTranspose2d-137        [-1, 128, 112, 112]         262,272
          Conv2d-138        [-1, 128, 112, 112]           3,328
            GELU-139        [-1, 128, 112, 112]               0
     BatchNorm2d-140        [-1, 128, 112, 112]             256
       Waveblock-141        [-1, 128, 112, 112]               0
          Conv2d-142         [-1, 32, 112, 112]           4,128
          Conv2d-143          [-1, 256, 56, 56]          33,024
            GELU-144          [-1, 256, 56, 56]               0
         Dropout-145          [-1, 256, 56, 56]               0
          Conv2d-146          [-1, 128, 56, 56]          32,896
     BatchNorm2d-147          [-1, 128, 56, 56]             256
 ConvTranspose2d-148        [-1, 128, 112, 112]         262,272
          Conv2d-149        [-1, 128, 112, 112]           3,328
            GELU-150        [-1, 128, 112, 112]               0
     BatchNorm2d-151        [-1, 128, 112, 112]             256
       Waveblock-152        [-1, 128, 112, 112]               0
          Conv2d-153         [-1, 32, 112, 112]           4,128
          Conv2d-154          [-1, 256, 56, 56]          33,024
            GELU-155          [-1, 256, 56, 56]               0
         Dropout-156          [-1, 256, 56, 56]               0
          Conv2d-157          [-1, 128, 56, 56]          32,896
     BatchNorm2d-158          [-1, 128, 56, 56]             256
 ConvTranspose2d-159        [-1, 128, 112, 112]         262,272
          Conv2d-160        [-1, 128, 112, 112]           3,328
            GELU-161        [-1, 128, 112, 112]               0
     BatchNorm2d-162        [-1, 128, 112, 112]             256
       Waveblock-163        [-1, 128, 112, 112]               0
 ConvTranspose2d-164         [-1, 64, 224, 224]         262,208
 ConvTranspose2d-165         [-1, 64, 224, 224]          36,928
     BatchNorm2d-166         [-1, 64, 224, 224]             128
 ConvTranspose2d-167          [-1, 3, 224, 224]           5,028
         WaveMix-168          [-1, 3, 224, 224]               0
          Conv2d-169         [-1, 64, 224, 224]           2,944
          Conv2d-170        [-1, 128, 112, 112]          73,856
          Conv2d-171         [-1, 32, 112, 112]           4,128
          Conv2d-172          [-1, 256, 56, 56]          33,024
            GELU-173          [-1, 256, 56, 56]               0
         Dropout-174          [-1, 256, 56, 56]               0
          Conv2d-175          [-1, 128, 56, 56]          32,896
     BatchNorm2d-176          [-1, 128, 56, 56]             256
 ConvTranspose2d-177        [-1, 128, 112, 112]         262,272
          Conv2d-178        [-1, 128, 112, 112]           3,328
            GELU-179        [-1, 128, 112, 112]               0
     BatchNorm2d-180        [-1, 128, 112, 112]             256
       Waveblock-181        [-1, 128, 112, 112]               0
          Conv2d-182         [-1, 32, 112, 112]           4,128
          Conv2d-183          [-1, 256, 56, 56]          33,024
            GELU-184          [-1, 256, 56, 56]               0
         Dropout-185          [-1, 256, 56, 56]               0
          Conv2d-186          [-1, 128, 56, 56]          32,896
     BatchNorm2d-187          [-1, 128, 56, 56]             256
 ConvTranspose2d-188        [-1, 128, 112, 112]         262,272
          Conv2d-189        [-1, 128, 112, 112]           3,328
            GELU-190        [-1, 128, 112, 112]               0
     BatchNorm2d-191        [-1, 128, 112, 112]             256
       Waveblock-192        [-1, 128, 112, 112]               0
          Conv2d-193         [-1, 32, 112, 112]           4,128
          Conv2d-194          [-1, 256, 56, 56]          33,024
            GELU-195          [-1, 256, 56, 56]               0
         Dropout-196          [-1, 256, 56, 56]               0
          Conv2d-197          [-1, 128, 56, 56]          32,896
     BatchNorm2d-198          [-1, 128, 56, 56]             256
 ConvTranspose2d-199        [-1, 128, 112, 112]         262,272
          Conv2d-200        [-1, 128, 112, 112]           3,328
            GELU-201        [-1, 128, 112, 112]               0
     BatchNorm2d-202        [-1, 128, 112, 112]             256
       Waveblock-203        [-1, 128, 112, 112]               0
          Conv2d-204         [-1, 32, 112, 112]           4,128
          Conv2d-205          [-1, 256, 56, 56]          33,024
            GELU-206          [-1, 256, 56, 56]               0
         Dropout-207          [-1, 256, 56, 56]               0
          Conv2d-208          [-1, 128, 56, 56]          32,896
     BatchNorm2d-209          [-1, 128, 56, 56]             256
 ConvTranspose2d-210        [-1, 128, 112, 112]         262,272
          Conv2d-211        [-1, 128, 112, 112]           3,328
            GELU-212        [-1, 128, 112, 112]               0
     BatchNorm2d-213        [-1, 128, 112, 112]             256
       Waveblock-214        [-1, 128, 112, 112]               0
          Conv2d-215         [-1, 32, 112, 112]           4,128
          Conv2d-216          [-1, 256, 56, 56]          33,024
            GELU-217          [-1, 256, 56, 56]               0
         Dropout-218          [-1, 256, 56, 56]               0
          Conv2d-219          [-1, 128, 56, 56]          32,896
     BatchNorm2d-220          [-1, 128, 56, 56]             256
 ConvTranspose2d-221        [-1, 128, 112, 112]         262,272
          Conv2d-222        [-1, 128, 112, 112]           3,328
            GELU-223        [-1, 128, 112, 112]               0
     BatchNorm2d-224        [-1, 128, 112, 112]             256
       Waveblock-225        [-1, 128, 112, 112]               0
          Conv2d-226         [-1, 32, 112, 112]           4,128
          Conv2d-227          [-1, 256, 56, 56]          33,024
            GELU-228          [-1, 256, 56, 56]               0
         Dropout-229          [-1, 256, 56, 56]               0
          Conv2d-230          [-1, 128, 56, 56]          32,896
     BatchNorm2d-231          [-1, 128, 56, 56]             256
 ConvTranspose2d-232        [-1, 128, 112, 112]         262,272
          Conv2d-233        [-1, 128, 112, 112]           3,328
            GELU-234        [-1, 128, 112, 112]               0
     BatchNorm2d-235        [-1, 128, 112, 112]             256
       Waveblock-236        [-1, 128, 112, 112]               0
          Conv2d-237         [-1, 32, 112, 112]           4,128
          Conv2d-238          [-1, 256, 56, 56]          33,024
            GELU-239          [-1, 256, 56, 56]               0
         Dropout-240          [-1, 256, 56, 56]               0
          Conv2d-241          [-1, 128, 56, 56]          32,896
     BatchNorm2d-242          [-1, 128, 56, 56]             256
 ConvTranspose2d-243        [-1, 128, 112, 112]         262,272
          Conv2d-244        [-1, 128, 112, 112]           3,328
            GELU-245        [-1, 128, 112, 112]               0
     BatchNorm2d-246        [-1, 128, 112, 112]             256
       Waveblock-247        [-1, 128, 112, 112]               0
 ConvTranspose2d-248         [-1, 64, 224, 224]         262,208
 ConvTranspose2d-249         [-1, 64, 224, 224]          36,928
     BatchNorm2d-250         [-1, 64, 224, 224]             128
 ConvTranspose2d-251          [-1, 3, 224, 224]           5,028
         WaveMix-252          [-1, 3, 224, 224]               0
          Conv2d-253         [-1, 64, 224, 224]           2,944
          Conv2d-254         [-1, 64, 224, 224]           2,944
          Conv2d-255        [-1, 128, 112, 112]          73,856
          Conv2d-256        [-1, 128, 112, 112]          73,856
          Conv2d-257         [-1, 32, 112, 112]           4,128
          Conv2d-258         [-1, 32, 112, 112]           4,128
          Conv2d-259          [-1, 256, 56, 56]          33,024
          Conv2d-260          [-1, 256, 56, 56]          33,024
            GELU-261          [-1, 256, 56, 56]               0
            GELU-262          [-1, 256, 56, 56]               0
         Dropout-263          [-1, 256, 56, 56]               0
         Dropout-264          [-1, 256, 56, 56]               0
          Conv2d-265          [-1, 128, 56, 56]          32,896
          Conv2d-266          [-1, 128, 56, 56]          32,896
     BatchNorm2d-267          [-1, 128, 56, 56]             256
     BatchNorm2d-268          [-1, 128, 56, 56]             256
 ConvTranspose2d-269        [-1, 128, 112, 112]         262,272
 ConvTranspose2d-270        [-1, 128, 112, 112]         262,272
          Conv2d-271        [-1, 128, 112, 112]           3,328
          Conv2d-272        [-1, 128, 112, 112]           3,328
            GELU-273        [-1, 128, 112, 112]               0
            GELU-274        [-1, 128, 112, 112]               0
     BatchNorm2d-275        [-1, 128, 112, 112]             256
     BatchNorm2d-276        [-1, 128, 112, 112]             256
       Waveblock-277        [-1, 128, 112, 112]               0
       Waveblock-278        [-1, 128, 112, 112]               0
          Conv2d-279         [-1, 32, 112, 112]           4,128
          Conv2d-280         [-1, 32, 112, 112]           4,128
          Conv2d-281          [-1, 256, 56, 56]          33,024
          Conv2d-282          [-1, 256, 56, 56]          33,024
            GELU-283          [-1, 256, 56, 56]               0
            GELU-284          [-1, 256, 56, 56]               0
         Dropout-285          [-1, 256, 56, 56]               0
         Dropout-286          [-1, 256, 56, 56]               0
          Conv2d-287          [-1, 128, 56, 56]          32,896
          Conv2d-288          [-1, 128, 56, 56]          32,896
     BatchNorm2d-289          [-1, 128, 56, 56]             256
     BatchNorm2d-290          [-1, 128, 56, 56]             256
 ConvTranspose2d-291        [-1, 128, 112, 112]         262,272
 ConvTranspose2d-292        [-1, 128, 112, 112]         262,272
          Conv2d-293        [-1, 128, 112, 112]           3,328
          Conv2d-294        [-1, 128, 112, 112]           3,328
            GELU-295        [-1, 128, 112, 112]               0
            GELU-296        [-1, 128, 112, 112]               0
     BatchNorm2d-297        [-1, 128, 112, 112]             256
     BatchNorm2d-298        [-1, 128, 112, 112]             256
       Waveblock-299        [-1, 128, 112, 112]               0
       Waveblock-300        [-1, 128, 112, 112]               0
          Conv2d-301         [-1, 32, 112, 112]           4,128
          Conv2d-302         [-1, 32, 112, 112]           4,128
          Conv2d-303          [-1, 256, 56, 56]          33,024
          Conv2d-304          [-1, 256, 56, 56]          33,024
            GELU-305          [-1, 256, 56, 56]               0
            GELU-306          [-1, 256, 56, 56]               0
         Dropout-307          [-1, 256, 56, 56]               0
         Dropout-308          [-1, 256, 56, 56]               0
          Conv2d-309          [-1, 128, 56, 56]          32,896
          Conv2d-310          [-1, 128, 56, 56]          32,896
     BatchNorm2d-311          [-1, 128, 56, 56]             256
     BatchNorm2d-312          [-1, 128, 56, 56]             256
 ConvTranspose2d-313        [-1, 128, 112, 112]         262,272
 ConvTranspose2d-314        [-1, 128, 112, 112]         262,272
          Conv2d-315        [-1, 128, 112, 112]           3,328
          Conv2d-316        [-1, 128, 112, 112]           3,328
            GELU-317        [-1, 128, 112, 112]               0
            GELU-318        [-1, 128, 112, 112]               0
     BatchNorm2d-319        [-1, 128, 112, 112]             256
     BatchNorm2d-320        [-1, 128, 112, 112]             256
       Waveblock-321        [-1, 128, 112, 112]               0
       Waveblock-322        [-1, 128, 112, 112]               0
          Conv2d-323         [-1, 32, 112, 112]           4,128
          Conv2d-324         [-1, 32, 112, 112]           4,128
          Conv2d-325          [-1, 256, 56, 56]          33,024
          Conv2d-326          [-1, 256, 56, 56]          33,024
            GELU-327          [-1, 256, 56, 56]               0
            GELU-328          [-1, 256, 56, 56]               0
         Dropout-329          [-1, 256, 56, 56]               0
         Dropout-330          [-1, 256, 56, 56]               0
          Conv2d-331          [-1, 128, 56, 56]          32,896
          Conv2d-332          [-1, 128, 56, 56]          32,896
     BatchNorm2d-333          [-1, 128, 56, 56]             256
     BatchNorm2d-334          [-1, 128, 56, 56]             256
 ConvTranspose2d-335        [-1, 128, 112, 112]         262,272
 ConvTranspose2d-336        [-1, 128, 112, 112]         262,272
          Conv2d-337        [-1, 128, 112, 112]           3,328
          Conv2d-338        [-1, 128, 112, 112]           3,328
            GELU-339        [-1, 128, 112, 112]               0
            GELU-340        [-1, 128, 112, 112]               0
     BatchNorm2d-341        [-1, 128, 112, 112]             256
     BatchNorm2d-342        [-1, 128, 112, 112]             256
       Waveblock-343        [-1, 128, 112, 112]               0
       Waveblock-344        [-1, 128, 112, 112]               0
          Conv2d-345         [-1, 32, 112, 112]           4,128
          Conv2d-346         [-1, 32, 112, 112]           4,128
          Conv2d-347          [-1, 256, 56, 56]          33,024
          Conv2d-348          [-1, 256, 56, 56]          33,024
            GELU-349          [-1, 256, 56, 56]               0
            GELU-350          [-1, 256, 56, 56]               0
         Dropout-351          [-1, 256, 56, 56]               0
         Dropout-352          [-1, 256, 56, 56]               0
          Conv2d-353          [-1, 128, 56, 56]          32,896
          Conv2d-354          [-1, 128, 56, 56]          32,896
     BatchNorm2d-355          [-1, 128, 56, 56]             256
     BatchNorm2d-356          [-1, 128, 56, 56]             256
 ConvTranspose2d-357        [-1, 128, 112, 112]         262,272
 ConvTranspose2d-358        [-1, 128, 112, 112]         262,272
          Conv2d-359        [-1, 128, 112, 112]           3,328
          Conv2d-360        [-1, 128, 112, 112]           3,328
            GELU-361        [-1, 128, 112, 112]               0
            GELU-362        [-1, 128, 112, 112]               0
     BatchNorm2d-363        [-1, 128, 112, 112]             256
     BatchNorm2d-364        [-1, 128, 112, 112]             256
       Waveblock-365        [-1, 128, 112, 112]               0
       Waveblock-366        [-1, 128, 112, 112]               0
          Conv2d-367         [-1, 32, 112, 112]           4,128
          Conv2d-368         [-1, 32, 112, 112]           4,128
          Conv2d-369          [-1, 256, 56, 56]          33,024
          Conv2d-370          [-1, 256, 56, 56]          33,024
            GELU-371          [-1, 256, 56, 56]               0
            GELU-372          [-1, 256, 56, 56]               0
         Dropout-373          [-1, 256, 56, 56]               0
         Dropout-374          [-1, 256, 56, 56]               0
          Conv2d-375          [-1, 128, 56, 56]          32,896
          Conv2d-376          [-1, 128, 56, 56]          32,896
     BatchNorm2d-377          [-1, 128, 56, 56]             256
     BatchNorm2d-378          [-1, 128, 56, 56]             256
 ConvTranspose2d-379        [-1, 128, 112, 112]         262,272
 ConvTranspose2d-380        [-1, 128, 112, 112]         262,272
          Conv2d-381        [-1, 128, 112, 112]           3,328
          Conv2d-382        [-1, 128, 112, 112]           3,328
            GELU-383        [-1, 128, 112, 112]               0
            GELU-384        [-1, 128, 112, 112]               0
     BatchNorm2d-385        [-1, 128, 112, 112]             256
     BatchNorm2d-386        [-1, 128, 112, 112]             256
       Waveblock-387        [-1, 128, 112, 112]               0
       Waveblock-388        [-1, 128, 112, 112]               0
          Conv2d-389         [-1, 32, 112, 112]           4,128
          Conv2d-390         [-1, 32, 112, 112]           4,128
          Conv2d-391          [-1, 256, 56, 56]          33,024
          Conv2d-392          [-1, 256, 56, 56]          33,024
            GELU-393          [-1, 256, 56, 56]               0
            GELU-394          [-1, 256, 56, 56]               0
         Dropout-395          [-1, 256, 56, 56]               0
         Dropout-396          [-1, 256, 56, 56]               0
          Conv2d-397          [-1, 128, 56, 56]          32,896
          Conv2d-398          [-1, 128, 56, 56]          32,896
     BatchNorm2d-399          [-1, 128, 56, 56]             256
     BatchNorm2d-400          [-1, 128, 56, 56]             256
 ConvTranspose2d-401        [-1, 128, 112, 112]         262,272
 ConvTranspose2d-402        [-1, 128, 112, 112]         262,272
          Conv2d-403        [-1, 128, 112, 112]           3,328
          Conv2d-404        [-1, 128, 112, 112]           3,328
            GELU-405        [-1, 128, 112, 112]               0
            GELU-406        [-1, 128, 112, 112]               0
     BatchNorm2d-407        [-1, 128, 112, 112]             256
     BatchNorm2d-408        [-1, 128, 112, 112]             256
       Waveblock-409        [-1, 128, 112, 112]               0
       Waveblock-410        [-1, 128, 112, 112]               0
 ConvTranspose2d-411         [-1, 64, 224, 224]         262,208
 ConvTranspose2d-412         [-1, 64, 224, 224]         262,208
 ConvTranspose2d-413         [-1, 64, 224, 224]          36,928
 ConvTranspose2d-414         [-1, 64, 224, 224]          36,928
     BatchNorm2d-415         [-1, 64, 224, 224]             128
     BatchNorm2d-416         [-1, 64, 224, 224]             128
 ConvTranspose2d-417          [-1, 3, 224, 224]           5,028
 ConvTranspose2d-418          [-1, 3, 224, 224]           5,028
         WaveMix-419          [-1, 3, 224, 224]               0
         WaveMix-420          [-1, 3, 224, 224]               0
================================================================
Total params: 13,671,060
Trainable params: 13,671,060
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 28812.00
Forward/backward pass size (MB): 3671.17
Params size (MB): 52.15
Estimated Total Size (MB): 32535.32
----------------------------------------------------------------
